package review;

public class _01_Var {
	public static void main(String[] args) {
		//자바1 : 자바의 기본 문법 (언어기본문법 + 객체지향)
		//자바2 : 자바에서 제공되는 클래스에 대해서
		
		/*
		 * -----언어 기본 문법-----
		 * 1일차 : 변수와 자료형
		 * 2일차 : 연산자
		 * 3일차 : 조건문
		 * 4일차 : 반복문, 제어문
		 * 5일차 : 배열, 함수(메서드)
		 * -----객체지향-----
		 * 6일차 : 클래스와 메서드
		 * 7일차 : 상속
		 * 8일차 : 인터페이스와 다형성
		 * 9~15일차 : 자바에서 제공되는 클래스(예외처리, 문자열, 랜덤, 시간, 컬렉션, 쓰레드, 스트림, 데이터베이스)
		 * 
		 */
		
		
		
		
		/*
		 * 1일차 : 변수와 자료형
		 * 변수 : 저장공간
		 * 자료형 : 데이터의 형태(int, double, String, boolean)
		 */
		
		//변수 선언
		int num;
		
		//변수 초기화
		double dnum = 3.14;
		
		//변수 대입
		dnum = 10.5;
		
		//자료형 변환
		num = (int)dnum;
		
		
		
		/*
		 * 2일차 : 연산자
		 */
	}
}
